---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffFixedLength
source: html/dea86de0-c21b-598a-bc6e-8ce6e130ff33.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffFixedLength Property

"Takeoff Fixed Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFamilyContentTakeoffFixedLength { get; }
```